## Pandas practise

In [ ]:
import pandas as pd
import numpy as np

##### Create a Pandas series

In [ ]:
data = [10, 20, 30, 40]
series = pd.Series(data)

In [ ]:
print(series)

0    10
1    20
2    30
3    40
dtype: int64

###### Create a Series datatype with custom index

In [ ]:
data = [10, 20, 30, 40]
label = ['apple', 'banana', 'orange', 'fig']
series = pd.Series(data, index=label)

In [ ]:
series

apple     10
banana    20
orange    30
fig       40
dtype: int64

##### Creating a Series from a Dictionary

In [ ]:
data = {
    'apple': 3,
    'banana': 2,
    'cherry': 5
}

series = pd.Series(data)

In [ ]:
series

apple     3
banana    2
cherry    5
dtype: int64

###### Creating a Series with Scalar Value

In [ ]:
label = ['apple', 'banana', 'orange', 'fig']
series = pd.Series(5, index=label)

In [ ]:
print(series)

apple     5
banana    5
orange    5
fig       5
dtype: int64

In [ ]:
# Empty series
series = pd.Series()
print(series)

Series([], dtype: object)

In [ ]:
# Creating series from numpy array
np_array = np.array([1,2,3,4,5])
series = pd.Series(np_array, index=['first', 'second', 'third', 'forth', 'fifth'])
print(series)

first     1
second    2
third     3
forth     4
fifth     5
dtype: int64